-- phpMyAdmin SQL Dump
-- version 4.8.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 02, 2019 at 09:40 AM
-- Server version: 10.1.37-MariaDB
-- PHP Version: 7.3.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `webpj`
--

-- --------------------------------------------------------

--
-- Table structure for table `algo_save`
--

CREATE TABLE `algo_save` (
  `date` date NOT NULL,
  `status` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `algo_save`
--

INSERT INTO `algo_save` (`date`, `status`) VALUES
('2019-07-26', 'SJF');

-- --------------------------------------------------------

--
-- Table structure for table `customer`
--

CREATE TABLE `customer` (
  `customer_ID` tinyint(3) UNSIGNED NOT NULL,
  `C_idcard` varchar(13) NOT NULL,
  `car_detail` varchar(50) NOT NULL,
  `customer_name` varchar(100) NOT NULL,
  `address` varchar(100) NOT NULL,
  `email` varchar(20) NOT NULL,
  `phone_num` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `customer`
--

INSERT INTO `customer` (`customer_ID`, `C_idcard`, `car_detail`, `customer_name`, `address`, `email`, `phone_num`) VALUES
(1, '1110358415181', 'honda', 'นาย ภูมิพิภัทร  อ่อนจ้อย', '2009/77', 'the_aponsdk@hotmail.', '0854854695'),
(2, '1103702248029', 'Phantom', 'นาย สมชาย ขาวสะอาด', '2009/77', 'zdpoom@hitmail.com', '0640789620'),
(3, '1651665', '1616515', 'นาย สมใจ ใจดี', '1651651', 'aaaa@dsdsad.com', '0561981651'),
(4, '1234563212312', 'HONDA-CRV', 'นาย วชิรวิทย์ มีแวว', '1661/44', 'wachi@gmail.com', '0589321030'),
(5, '1235754323412', 'HONDA-Civic', 'นาย เอกกมล ณรุณ', '155616', 'eekamon@gmail.com', '0948374921'),
(6, '2345123235678', 'HONDA-CRV', 'นาย อณิรุท ตามใจ', '858/88', 'anirut@gmail.com', '0640589820');

-- --------------------------------------------------------

--
-- Table structure for table `detail`
--

CREATE TABLE `detail` (
  `ord_ID` tinyint(3) UNSIGNED NOT NULL,
  `detail_ID` tinyint(3) UNSIGNED NOT NULL,
  `customer_name` varchar(100) NOT NULL,
  `M_name` varchar(100) NOT NULL,
  `user_fname` varchar(50) NOT NULL,
  `date` date NOT NULL,
  `time` time NOT NULL,
  `priority` smallint(50) NOT NULL,
  `all_time` smallint(50) NOT NULL,
  `status` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `detail`
--

INSERT INTO `detail` (`ord_ID`, `detail_ID`, `customer_name`, `M_name`, `user_fname`, `date`, `time`, `priority`, `all_time`, `status`) VALUES
(3, 1, 'นาย สมใจ ใจดี', 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-12', '10:28:55', 14, 90, ''),
(3, 2, 'นาย สมใจ ใจดี', 'ตรวจเช็คยางและแรงดันลมยาง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-12', '10:28:55', 14, 90, ''),
(3, 3, 'นาย สมใจ ใจดี', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-12', '10:28:55', 14, 90, ''),
(4, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-12', '10:31:07', 13, 80, ''),
(4, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คยางและแรงดันลมยาง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-12', '10:31:08', 13, 80, ''),
(5, 1, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-12', '10:36:52', 12, 80, ''),
(5, 2, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คยางและแรงดันลมยาง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-12', '10:36:52', 12, 80, ''),
(6, 1, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:20:18', 1, 80, ''),
(6, 2, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:20:18', 1, 80, ''),
(7, 1, 'นาย สมใจ ใจดี', 'ตรวจเช็คระบบทำความเย็น / ฮีตเตอร์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:00', 23, 60, ''),
(7, 2, 'นาย สมใจ ใจดี', 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:00', 23, 60, ''),
(8, 1, 'นาย วชิรวิทย์ มีแวว', 'เปลี่ยนกรองน้ำมันเชื้อเพลิง  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:20', 13, 110, ''),
(8, 2, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:20', 13, 110, ''),
(8, 3, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:20', 13, 110, ''),
(9, 1, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คน้ำมันเกียร์อัตโนมัติ', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:44', 2, 190, ''),
(9, 2, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คยางและแรงดันลมยาง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:44', 2, 190, ''),
(9, 3, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:44', 2, 190, ''),
(9, 4, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คระบบปรับอากาศและสารทำความเย็น', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:21:44', 2, 190, ''),
(10, 1, 'นาย อณิรุท ตามใจ', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:22:17', 13, 170, ''),
(10, 2, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คระบบทำความเย็น / ฮีตเตอร์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:22:17', 13, 170, ''),
(10, 3, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:22:17', 13, 170, ''),
(10, 4, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คหม้อดักน้ำ  (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:22:17', 13, 170, ''),
(10, 5, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คน้ำมันพาเวอร์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-28', '10:22:17', 13, 170, ''),
(13, 1, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คสายพานเครื่องยนต์เบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-30', '22:43:57', 2, 200, ''),
(13, 2, 'นาย อณิรุท ตามใจ', 'เปลี่ยนผ้าเบรกและดรัมเบรก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-30', '22:43:57', 2, 200, ''),
(13, 4, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คพวงมาลัย / ข้อต่อบังคับเลี้ยว และ กระปุกเกียร์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-30', '22:43:57', 2, 200, ''),
(14, 1, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-30', '22:46:19', 5, 100, ''),
(14, 2, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คน้ำหล่อเย็นเครื่องยนต์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-30', '22:46:19', 5, 100, ''),
(14, 3, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนไส้กรองอากาศ  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-30', '22:46:20', 5, 100, ''),
(14, 4, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนน้ำมันคลัตซ์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-05-30', '22:46:20', 5, 100, ''),
(16, 1, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-13', '14:27:53', 5, 160, ''),
(16, 2, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คสายพานเครื่องยนต์เบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-13', '14:27:53', 5, 160, ''),
(16, 3, 'นาย อณิรุท ตามใจ', 'เปลี่ยนกรองน้ำมันเชื้อเพลิง   (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-13', '14:27:53', 5, 160, ''),
(16, 4, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คน้ำหล่อเย็นเครื่องยนต์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-13', '14:27:53', 5, 160, ''),
(16, 5, 'นาย อณิรุท ตามใจ', 'เปลี่ยนสายพานเครื่องยนเบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-13', '14:27:53', 5, 160, ''),
(17, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-18', '09:41:05', 0, 110, ''),
(17, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนเบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-18', '09:41:05', 0, 110, ''),
(17, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-18', '09:41:05', 0, 110, ''),
(18, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:22:32', 3, 80, ''),
(18, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คสายพานเครื่องยนต์เบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:22:32', 3, 80, ''),
(18, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คหัวเทียน  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:22:32', 3, 80, ''),
(19, 1, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 5L-E', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:36:08', 2, 180, ''),
(19, 2, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คหัวเทียน  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:36:08', 2, 180, ''),
(19, 3, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนกรองน้ำมันเชื้อเพลิง   (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:36:08', 2, 180, ''),
(19, 4, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนกรองน้ำมันเชื้อเพลิง  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:36:08', 2, 180, ''),
(20, 1, 'นาย วชิรวิทย์ มีแวว', 'เปลี่ยนกรองน้ำมันเชื้อเพลิง   (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:36:20', 6, 110, ''),
(20, 2, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:36:20', 6, 110, ''),
(20, 3, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-21', '21:36:20', 6, 110, ''),
(21, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนเบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:13', 1, 50, ''),
(21, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนน้ำมันเครื่อง  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:13', 1, 50, ''),
(21, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:13', 1, 50, ''),
(21, 4, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:13', 1, 50, ''),
(21, 5, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คหัวเทียน  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:13', 1, 50, ''),
(22, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 5L-E', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:29', 3, 140, ''),
(22, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:29', 3, 140, ''),
(22, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คน้ำหล่อเย็นเครื่องยนต์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:29', 3, 140, ''),
(22, 4, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:29', 3, 140, ''),
(23, 1, 'นาย สมใจ ใจดี', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:59', 2, 60, ''),
(23, 2, 'นาย สมใจ ใจดี', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:50:59', 2, 60, ''),
(24, 1, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:51:16', 1, 160, ''),
(24, 2, 'นาย วชิรวิทย์ มีแวว', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:51:16', 1, 160, ''),
(24, 3, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:51:16', 1, 160, ''),
(24, 4, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:51:16', 1, 160, ''),
(24, 5, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระบบทำความเย็น / ฮีตเตอร์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:51:16', 1, 160, ''),
(25, 1, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คระบบปรับอากาศและสารทำความเย็น', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:51:34', 3, 140, ''),
(25, 2, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คท่อน้ำมันเบรกและท่อยาง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:51:34', 3, 140, ''),
(25, 3, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คหม้อดักน้ำ  (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-23', '15:51:34', 3, 140, ''),
(26, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:37', 0, 130, ''),
(26, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 2KD-FTV', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:38', 0, 130, ''),
(27, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนน้ำมันเครื่อง  (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:47', 0, 110, ''),
(27, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 5L-E', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:48', 0, 110, ''),
(27, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนไส้กรองอากาศ  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:48', 0, 110, ''),
(28, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คสายพานเครื่องยนต์ดีเซล 5L-E', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:57', 0, 90, ''),
(28, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คสายพานเครื่องยนต์ดีเซล 5L-E', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:58', 0, 90, ''),
(28, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนไส้กรองอากาศ  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:58', 0, 90, ''),
(28, 4, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-06-26', '20:05:58', 0, 90, ''),
(29, 1, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:18:40', 4, 130, ''),
(29, 2, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:18:40', 4, 130, ''),
(30, 1, 'นาย สมใจ ใจดี', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:18:59', 3, 160, ''),
(30, 2, 'นาย สมใจ ใจดี', 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:18:59', 3, 160, ''),
(30, 3, 'นาย สมใจ ใจดี', 'ตรวจเช็คระบบปรับอากาศและสารทำความเย็น', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:18:59', 3, 160, ''),
(31, 1, 'นาย วชิรวิทย์ มีแวว', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:19:13', 2, 110, ''),
(31, 2, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:19:13', 2, 110, ''),
(31, 3, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:19:13', 2, 110, ''),
(32, 1, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:19:37', 1, 210, ''),
(32, 2, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คยางและแรงดันลมยาง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:19:38', 1, 210, ''),
(32, 3, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คระบบรองรับน้ำหนักด้านหน้า/ด้านหลัง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:19:38', 1, 210, ''),
(32, 4, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คระบบปรับอากาศและสารทำความเย็น', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:19:38', 1, 210, ''),
(32, 5, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คน้ำมันคลัตซ์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-01', '11:19:38', 1, 210, ''),
(33, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 5L-E', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:10:28', 2, 110, ''),
(33, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:10:29', 2, 110, ''),
(33, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนน้ำมันเครื่อง  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:10:29', 2, 110, ''),
(34, 1, 'นาย สมใจ ใจดี', 'ตรวจเช็คสายพานเครื่องยนต์เบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-05', '14:12:46', 0, 30, ''),
(34, 2, 'นาย สมใจ ใจดี', 'ตรวจเช็คสายพานเครื่องยนต์ดีเซล 2KD-FTV', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-05', '14:12:47', 0, 30, ''),
(35, 1, 'นาย สมใจ ใจดี', 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 5L-E', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-05', '14:13:09', 0, 90, ''),
(35, 2, 'นาย สมใจ ใจดี', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-05', '14:13:09', 0, 90, ''),
(36, 1, 'นาย เอกกมล ณรุณ', 'เปลี่ยนน้ำมันเครื่อง  (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:14:16', 0, 60, ''),
(36, 2, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:14:17', 0, 60, ''),
(36, 3, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:14:17', 0, 60, ''),
(37, 1, 'นาย วชิรวิทย์ มีแวว', 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:16:48', 0, 80, ''),
(37, 2, 'นาย วชิรวิทย์ มีแวว', 'เปลี่ยนสายพานเครื่องยนเบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:16:48', 0, 80, ''),
(37, 3, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '14:16:48', 0, 80, ''),
(38, 1, 'นาย เอกกมล ณรุณ', 'เปลี่ยนสายพานเครื่องยนเบนซิน', 'นาย วรโชต ลำมะนา', '2019-07-04', '14:32:08', 0, 100, ''),
(38, 2, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คระบบทำความเย็น / ฮีตเตอร์', 'นาย วรโชต ลำมะนา', '2019-07-04', '14:32:08', 0, 100, ''),
(38, 3, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คระดับไฟหน้า', 'นาย วรโชต ลำมะนา', '2019-07-04', '14:32:08', 0, 100, ''),
(39, 1, 'นาย เอกกมล ณรุณ', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-04', '15:45:48', 0, 30, ''),
(40, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนเบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-05', '12:04:04', 0, 80, ''),
(40, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-05', '12:04:04', 0, 80, ''),
(41, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 2KD-FTV', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-05', '13:42:54', 0, 100, ''),
(41, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-05', '13:42:54', 0, 100, ''),
(42, 1, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:00', 1, 100, ''),
(42, 2, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คระบบทำความเย็น / ฮีตเตอร์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:01', 1, 100, ''),
(42, 3, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:01', 1, 100, ''),
(43, 1, 'นาย สมใจ ใจดี', 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:24', 1, 130, ''),
(43, 2, 'นาย สมใจ ใจดี', 'เปลี่ยนน้ำมันเครื่อง  (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:24', 1, 130, ''),
(43, 3, 'นาย สมใจ ใจดี', 'เปลี่ยนกรองน้ำมันเชื้อเพลิง   (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:25', 1, 130, ''),
(44, 1, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:54', 2, 200, ''),
(44, 2, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:54', 2, 200, ''),
(44, 3, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:54', 2, 200, ''),
(44, 4, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระบบรองรับน้ำหนักด้านหน้า/ด้านหลัง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:54', 2, 200, ''),
(44, 5, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คยางและแรงดันลมยาง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:56:54', 2, 200, ''),
(45, 1, 'นาย เอกกมล ณรุณ', 'เปลี่ยนน้ำมันเกียร์อัตโนมัติ', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:57:28', 3, 160, ''),
(45, 2, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คระบบปรับอากาศและสารทำความเย็น', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:57:28', 3, 160, ''),
(45, 3, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คน้ำมันเบรก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:57:29', 3, 160, ''),
(45, 4, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คท่อน้ำมันเบรกและท่อยาง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '09:57:29', 3, 160, ''),
(46, 1, 'นาย อณิรุท ตามใจ', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-10', '10:51:57', 0, 30, ''),
(47, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:42:47', 2, 130, ''),
(47, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:42:48', 2, 130, ''),
(47, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:42:48', 2, 130, ''),
(48, 1, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:14', 1, 200, ''),
(48, 2, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:14', 1, 200, ''),
(48, 3, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:15', 1, 200, ''),
(48, 4, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนกรองน้ำมันเครื่อง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:16', 1, 200, ''),
(48, 5, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:17', 1, 200, ''),
(49, 1, 'นาย สมใจ ใจดี', 'ตรวจเช็คท่อไอเสีย / ขายึด', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:32', 2, 80, ''),
(49, 2, 'นาย สมใจ ใจดี', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:32', 2, 80, ''),
(50, 1, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:57', 2, 90, ''),
(50, 2, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:44:00', 2, 90, ''),
(50, 3, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:44:01', 2, 90, ''),
(51, 1, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:43:59', 1, 90, ''),
(51, 2, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คระดับไฟหน้า', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:44:00', 1, 90, ''),
(51, 3, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คแบตเตอรี่', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-16', '19:44:01', 1, 90, ''),
(52, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-25', '11:39:09', 0, 100, ''),
(52, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-25', '11:39:09', 0, 100, ''),
(53, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-25', '12:37:19', 0, 60, ''),
(53, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'ตรวจเช็คสายพานเครื่องยนต์เบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-25', '12:37:19', 0, 60, ''),
(54, 1, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนเบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-25', '12:42:36', 0, 110, ''),
(54, 2, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนสายพานเครื่องยนเบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-25', '12:42:36', 0, 110, ''),
(54, 3, 'นาย ภูมิพิภัทร  อ่อนจ้อย', 'เปลี่ยนกรองน้ำมันเชื้อเพลิง   (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-25', '12:42:36', 0, 110, ''),
(55, 1, 'นาย สมชาย ขาวสะอาด', 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-26', '12:54:27', 3, 100, ''),
(55, 2, 'นาย สมชาย ขาวสะอาด', 'ตรวจเช็คหม้อดักน้ำ  (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-26', '12:54:27', 3, 100, ''),
(56, 1, 'นาย สมใจ ใจดี', 'ตรวจเช็คควันไอเสีย  (เครื่องยนต์ดีเซล)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-26', '12:57:42', 1, 10, ''),
(57, 1, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คไส้กรองอากาศ  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-26', '12:58:54', 3, 20, ''),
(57, 2, 'นาย วชิรวิทย์ มีแวว', 'ตรวจเช็คสายพานเครื่องยนต์เบนซิน', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-26', '12:58:54', 3, 20, ''),
(58, 1, 'นาย เอกกมล ณรุณ', 'ตรวจเช็คไส้กรองอากาศ  (เครื่องยนต์เบนซิน)', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-26', '12:59:38', 4, 10, ''),
(59, 1, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คน้ำหล่อเย็นเครื่องยนต์', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-26', '13:00:48', 2, 50, ''),
(59, 2, 'นาย อณิรุท ตามใจ', 'ตรวจเช็คระบบรองรับน้ำหนักด้านหน้า/ด้านหลัง', 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-07-26', '13:00:48', 2, 50, '');

-- --------------------------------------------------------

--
-- Table structure for table `maintenance`
--

CREATE TABLE `maintenance` (
  `M_ID` tinyint(3) UNSIGNED NOT NULL,
  `M_name` varchar(100) NOT NULL,
  `M_time` tinyint(4) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `maintenance`
--

INSERT INTO `maintenance` (`M_ID`, `M_name`, `M_time`) VALUES
(1, 'เปลี่ยนสายพานไทม์มิ่ง (เครื่องยนต์ดีเซล)', 50),
(2, 'ตรวจเช็คระยะห่างวาล์ว (เครื่องยนต์ดีเซล)', 50),
(3, 'เปลี่ยนสายพานเครื่องยนเบนซิน', 30),
(4, 'ตรวจเช็คสายพานเครื่องยนต์เบนซิน', 10),
(5, 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 2KD-FTV', 50),
(6, 'ตรวจเช็คสายพานเครื่องยนต์ดีเซล 2KD-FTV', 20),
(7, 'เปลี่ยนสายพานเครื่องยนต์ดีเซล 5L-E', 60),
(8, 'ตรวจเช็คสายพานเครื่องยนต์ดีเซล 5L-E', 20),
(9, 'เปลี่ยนน้ำมันเครื่อง  (เครื่องยนต์ดีเซล)', 30),
(10, 'เปลี่ยนน้ำมันเครื่อง  (เครื่องยนต์เบนซิน)', 20),
(11, 'เปลี่ยนกรองน้ำมันเครื่อง', 30),
(12, 'ตรวจเช็คระบบทำความเย็น / ฮีตเตอร์', 40),
(13, 'ตรวจเช็คน้ำหล่อเย็นเครื่องยนต์', 20),
(14, 'ตรวจเช็คท่อไอเสีย / ขายึด', 30),
(15, 'ตรวจเช็คระดับไฟหน้า', 30),
(16, 'ตรวจเช็คหัวเทียน  (เครื่องยนต์เบนซิน)', 20),
(17, 'ตรวจเช็คแบตเตอรี่', 30),
(18, 'เปลี่ยนกรองน้ำมันเชื้อเพลิง  (เครื่องยนต์เบนซิน)', 50),
(19, 'เปลี่ยนกรองน้ำมันเชื้อเพลิง   (เครื่องยนต์ดีเซล)', 50),
(20, 'ตรวจเช็คหม้อดักน้ำ  (เครื่องยนต์ดีเซล)', 50),
(21, 'เปลี่ยนไส้กรองอากาศ  (เครื่องยนต์เบนซิน)', 20),
(22, 'ตรวจเช็คไส้กรองอากาศ  (เครื่องยนต์เบนซิน)', 10),
(23, 'เปลี่ยนไส้กรองอากาศ  (เครื่องยนต์ดีเซล)', 30),
(24, 'ตรวจเช็คไส้กรองอากาศ  (เครื่องยนต์ดีเซล)', 20),
(25, 'ตรวจเช็คควันไอเสีย  (เครื่องยนต์ดีเซล)', 10),
(26, 'ตรวจเช็คฝาเปิดปิดถังน้ำมันเชื้อเพลิง / ท่อเชื้อเพลิง และ ข้อต่อ', 60),
(27, 'ตรวจเช็คหม้อดักไอน้ำมัน  (เครื่องยนต์เบนซิน)', 20),
(28, 'ตรวจเช็คแป้นเบรกและเบรกมือ', 30),
(29, 'ตรวจเช็ค ผ้าเบรกและดรัมเบรก', 20),
(30, 'เปลี่ยนผ้าเบรกและดรัมเบรก', 40),
(31, 'ตรวจเช็คน้ำมันเบรก', 30),
(32, 'เปลี่ยนน้ำมันเบรก', 30),
(33, 'ตรวจเช็คน้ำมันคลัตซ์', 20),
(34, 'เปลี่ยนน้ำมันคลัตซ์', 30),
(35, 'ตรวจเช็คท่อน้ำมันเบรกและท่อยาง', 40),
(36, 'ตรวจเช็คปั้มสูญญากาศของหม้อลมเบรก (เครื่องยนต์ดีเซล)', 40),
(37, 'ตรวจเช็คน้ำมันพาเวอร์', 20),
(38, 'เปลี่ยนน้ำมันพาเวอร์', 30),
(40, 'ตรวจเช็คพวงมาลัย / ข้อต่อบังคับเลี้ยว และ กระปุกเกียร์', 50),
(41, 'ตรวจเช็คท่อน้ำมันปั๊มสูญญากาศ (เครื่องยนต์5L-E)', 50),
(42, 'ตรวจเช็ควาล์วระบายห้องแคล้งค์ / ท่อระบาย และ ข้อต่อ', 30),
(43, 'ตรวจเช็คลูกหมาก และ ฝาครอบกันฝุ่น', 30),
(44, 'ตรวจเช็คน้ำมันเฟืองท้าย', 30),
(45, 'เปลี่ยนน้ำมันเฟืองท้าย', 20),
(46, 'ตรวจเช็คน้ำมันเกียร์ธรรมดา', 30),
(47, 'เปลี่ยนน้ำมันเกียร์ธรรมดา', 30),
(48, 'ตรวจเช็คน้ำมันเกียร์อัตโนมัติ', 30),
(49, 'เปลี่ยนน้ำมันเกียร์อัตโนมัติ', 40),
(50, 'ตรวจเช็คระบบรองรับน้ำหนักด้านหน้า/ด้านหลัง', 30),
(51, 'ตรวจเช็คยางและแรงดันลมยาง', 30),
(52, 'ตรวจเช็คไฟทุกดวง / แตร / ที่ปัดน้ำฝน และที่ฉีดน้ำล้างกระจก', 80),
(53, 'ตรวจเช็คระบบปรับอากาศและสารทำความเย็น', 50);

-- --------------------------------------------------------

--
-- Table structure for table `position`
--

CREATE TABLE `position` (
  `position_ID` tinyint(3) UNSIGNED NOT NULL,
  `user_position` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `position`
--

INSERT INTO `position` (`position_ID`, `user_position`) VALUES
(1, 'ผุ้ดุแลระบบ'),
(2, 'พนักงาน');

-- --------------------------------------------------------

--
-- Table structure for table `queue`
--

CREATE TABLE `queue` (
  `ord_ID` tinyint(3) UNSIGNED NOT NULL,
  `customer_name` varchar(100) NOT NULL,
  `user_fname` varchar(50) NOT NULL,
  `start_time` time NOT NULL,
  `finishing_time` time NOT NULL,
  `job_status` varchar(20) NOT NULL,
  `day` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `user_ID` tinyint(3) UNSIGNED NOT NULL,
  `position_ID` tinyint(3) UNSIGNED NOT NULL,
  `user_fname` varchar(50) NOT NULL,
  `user_fday` date NOT NULL,
  `address` varchar(100) NOT NULL,
  `birthday` date NOT NULL,
  `id_card` varchar(13) NOT NULL,
  `username` varchar(20) NOT NULL,
  `password` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`user_ID`, `position_ID`, `user_fname`, `user_fday`, `address`, `birthday`, `id_card`, `username`, `password`) VALUES
(1, 1, 'นาย ภัทรภูมิ อ่อนจ้อย', '2019-02-01', '2009/77', '2019-02-22', '1100501376787', 'admin', '1234'),
(4, 1, 'นาย วรโชต ลำมะนา', '2019-02-07', '2009/77', '2019-02-16', '1103702248028', 'user', '1235'),
(6, 2, 'nawna', '2019-02-01', '2009/77', '2019-02-23', '222558264946', 'newna', 'password'),
(7, 2, 'poom', '2019-02-06', '2009/66', '2019-02-05', '1103702248206', 'poom', 'password');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `customer`
--
ALTER TABLE `customer`
  ADD PRIMARY KEY (`customer_ID`),
  ADD UNIQUE KEY `C_idcard` (`C_idcard`),
  ADD UNIQUE KEY `customer_name` (`customer_name`);

--
-- Indexes for table `detail`
--
ALTER TABLE `detail`
  ADD PRIMARY KEY (`ord_ID`,`detail_ID`) USING BTREE,
  ADD KEY `customer_name` (`customer_name`),
  ADD KEY `M_name` (`M_name`),
  ADD KEY `user_fname` (`user_fname`);

--
-- Indexes for table `maintenance`
--
ALTER TABLE `maintenance`
  ADD PRIMARY KEY (`M_ID`),
  ADD UNIQUE KEY `M_name` (`M_name`);

--
-- Indexes for table `position`
--
ALTER TABLE `position`
  ADD PRIMARY KEY (`position_ID`);

--
-- Indexes for table `queue`
--
ALTER TABLE `queue`
  ADD PRIMARY KEY (`ord_ID`),
  ADD KEY `customer_name` (`customer_name`),
  ADD KEY `user_fname` (`user_fname`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`user_ID`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `user_fname` (`user_fname`),
  ADD UNIQUE KEY `id_card` (`id_card`),
  ADD KEY `position_ID` (`position_ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `customer`
--
ALTER TABLE `customer`
  MODIFY `customer_ID` tinyint(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `detail`
--
ALTER TABLE `detail`
  MODIFY `ord_ID` tinyint(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- AUTO_INCREMENT for table `maintenance`
--
ALTER TABLE `maintenance`
  MODIFY `M_ID` tinyint(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=54;

--
-- AUTO_INCREMENT for table `position`
--
ALTER TABLE `position`
  MODIFY `position_ID` tinyint(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `queue`
--
ALTER TABLE `queue`
  MODIFY `ord_ID` tinyint(3) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `user_ID` tinyint(3) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `detail`
--
ALTER TABLE `detail`
  ADD CONSTRAINT `detail_ibfk_1` FOREIGN KEY (`customer_name`) REFERENCES `customer` (`customer_name`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `detail_ibfk_2` FOREIGN KEY (`M_name`) REFERENCES `maintenance` (`M_name`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `detail_ibfk_3` FOREIGN KEY (`user_fname`) REFERENCES `user` (`user_fname`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `queue`
--
ALTER TABLE `queue`
  ADD CONSTRAINT `queue_ibfk_1` FOREIGN KEY (`customer_name`) REFERENCES `customer` (`customer_name`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `queue_ibfk_2` FOREIGN KEY (`user_fname`) REFERENCES `detail` (`user_fname`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `queue_ibfk_3` FOREIGN KEY (`ord_ID`) REFERENCES `detail` (`ord_ID`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `user`
--
ALTER TABLE `user`
  ADD CONSTRAINT `user_ibfk_1` FOREIGN KEY (`position_ID`) REFERENCES `position` (`position_ID`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
